app/controllers/photo_controller.rb

    def photo
        @photo=Photo.all
---
SELECT "photos".* FROM "photos"