app/controllers/photo_controller.rb

    def photo
        @photo=Photo.order(created_at: :desc).page(params[:page]).per(15)
---
SELECT COUNT(*) FROM "photos"