app/controllers/user_controller_controller.rb

    def index
        @users= User.first
        @user_address=Address.where(:id=>User.first.address_id).first
        @experience= User.first.experience
        @education= User.first.education
        @projects=User.first.personalprojects
        @awards=User.first.personalaward
---
SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT  "addresses".* FROM "addresses" INNER JOIN "addresses_users" ON "addresses"."id" = "addresses_users"."address_id" WHERE "addresses_users"."user_id" = $1 ORDER BY "addresses"."id" ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT  "addresses".* FROM "addresses" INNER JOIN "addresses_experiences" ON "addresses"."id" = "addresses_experiences"."address_id" WHERE "addresses_experiences"."experience_id" = $1 ORDER BY "addresses"."id" ASC LIMIT $2  [["experience_id", 1], ["LIMIT", 1]]
SELECT "experiences".* FROM "experiences" WHERE "experiences"."user_id" = $1  [["user_id", 1]]
SELECT "educations".* FROM "educations" WHERE "educations"."user_id" = $1  [["user_id", 1]]
SELECT "personalprojects".* FROM "personalprojects" WHERE "personalprojects"."user_id" = $1  [["user_id", 1]]
SELECT "personalawards".* FROM "personalawards" WHERE "personalawards"."user_id" = $1  [["user_id", 1]]