app/views/user_controller/index.html.erb

SELECT  "addresses".* FROM "addresses" WHERE "addresses"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---
          <h1 class="name"><%= @users.name %></h1>
          <address><%=@users.address.first.city%>, <%=@users.address.first.state%></address>

SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
          <tr>
            <td><%= e.address.first.city %>, <%= e.address.first.state %></td>